{"acadYear": "2020/2021", "preclusion": "PP5269 – DE 5269 is replacing PP5269 for the MEM Program", "description": "The main aim of this module is to arrive at set of economic policies that would facilitate sustainable development. These policies are demonstrated at both microeconomic and macroeconomic levels. The distinguishing feature of this demonstration is the recognition of the laws of thermodynamics and ecological resilience.\nThe microeconomic analysis will begin with a critical review of basic concepts pertaining to consumption, preferences, demand, production, costs and markets. The standard approaches to natural resource management would be then considered in the light of this critical review. The internalization of thermodynamic principles and other scientific paradigms into the analytic frameworks of microeconomics can prompt deviations from the standard approaches to resource management.\nThe macroeconomic analysis begins with methods of environmental accounting, which recognizes nature as capital besides labour and manufactured capital. The validity of this perception will be tested by recourse to a simple macroeconomic framework, which explicitly regards all natural resources as an aggregate item of capital. The class will be guided towards the formulation and application of this macroeconomic framework for the analysis of sustainable development.\nThe final section of the course concerns the assembly of various management policies that strive for sustainable development.", "title": "Environmental Economics and Sustainable Development", "department": "SDE Dean's Office", "faculty": "Design and Environment", "workload": [3, 0, 0, 4, 3], "moduleCredit": "4", "moduleCode": "DE5269", "semesterData": [{"semester": 1, "timetable": [{"classNo": "1", "startTime": "1830", "endTime": "2130", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_A", "day": "Thursday", "lessonType": "Lecture", "size": 60, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}]}