{"acadYear": "2020/2021", "description": "Planners deal with a myriad of issues and have to work with various planning processes to deal with them. From an expert driven blueprint to the bottom-up public engagement, there is a constant flow of data that directly and indirectly aid them in their work. This module aims to furnish students with the appropriate tools to use when dealing with qualitative data. Some of them include field study, survey and interview, questionnaire design and site inspections, which will be applicable to urban planning analyses. \n\nStudents will appreciate the discourse on quantitative versus qualitative data and the central ideas in qualitative research - appropriateness of methods and theories; perspectives of the participants and their diversity; reflexivity of the researcher and the research; variety of approaches; and methods in qualitative research. \n\nThe course emphasizes on “hands on” with actual field work forming the bulk of the learning process and provides the opportunity for students to learn to collect, analyze and present qualitative data relating to planning and urban issues. This would encourage a better appreciation of the social issues in the urban context.", "title": "Qualitative Methods for Urban Planning", "department": "SDE Dean's Office", "faculty": "Design and Environment", "workload": [2, 0, 0, 4, 4], "prerequisite": "Must be taken together with DEP5101 Urban Analysis Workshop", "moduleCredit": "4", "moduleCode": "DEP5101A", "attributes": {"fyp": true}, "semesterData": [{"semester": 1, "timetable": [{"classNo": "1", "startTime": "1400", "endTime": "1700", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "UTSRC-LT51", "day": "Tuesday", "lessonType": "Lecture", "size": 30, "covidZone": "A"}, {"classNo": "2", "startTime": "1700", "endTime": "1802", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "", "day": "Tuesday", "lessonType": "Tutorial", "size": 30, "covidZone": "Unknown"}], "covidZones": ["A", "Unknown"]}], "fulfillRequirements": ["DEP5109"]}