{"acadYear": "2020/2021", "description": "Business analysts / consultants hold strategic positions within the knowledge-based firm. They support the Supply Chain, Marketing, Finance and HR departments in refining their processes, making them more efficient, profitable and customer-centric. A 2006 Money magazine survey ranks the business analyst position among the top jobs with regards to salary, advancement prospects, satisfaction and stress level.    \n\n\n\nThe objective of this capstone course is to prepare participants for the work environment and the diverse challenges faced by business analysts and consultants. Through the pedagogical medium of cases, participants will polish their skills in analytics and the written and oral communications of their results to a Management audience.\n\n\n\nThe course will cover topics such as Decision & Risk Analysis, Optimization, Simulation, Data Mining and Forecasting. Participants will gain extensive experience in analytical software such as Precision Tree, Solver and Evolutionary Solver, @Risk and StatTools.  Cases will highlight timely problems e.g. cash flow / revenue management, supply chain optimization, reverse auctions, staff right-sizing, outsourcing, benchmarking, CRM (e.g. customer segmentation, clustering), seasonal demand forecasting etc.", "title": "Analytical Tools for Consulting", "department": "Analytics and Operations", "faculty": "NUS Business School", "prerequisite": "DSC1007 or IE2110 or DSC3214", "moduleCredit": "4", "moduleCode": "DSC4213", "aliases": ["DBA4811"], "semesterData": [{"semester": 1, "timetable": [{"classNo": "A1", "startTime": "1500", "endTime": "1800", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "BIZ2-0509", "day": "Tuesday", "lessonType": "Sectional Teaching", "size": 60, "covidZone": "A"}], "covidZones": ["A"]}, {"semester": 2, "timetable": [{"classNo": "A1", "startTime": "1500", "endTime": "1800", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_C", "day": "Thursday", "lessonType": "Sectional Teaching", "size": 40, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}], "prereqTree": {"or": ["DSC1007", "IE2110", "DSC3214"]}}