{"acadYear": "2020/2021", "preclusion": "TEE4214, TIC2401", "description": "The objectives of this module are to present the theoretical foundations of real-time systems and to discuss the practical aspects of their implementation. It describes the characteristics of a real-time computing system and students are taught how to design a real-time embedded system using structured data flow methodology. Concepts of time-critical I/O and real-time deadlines are emphasized, as are the important aspects of real-time operating systems, scheduling and the practical implementation of embedded systems and firmware. Other topics covered include deadlock management and process communications. Various case studies on industrial real-time systems will be exhibited to give students a real-world feel for such systems. Students will undertake a mini project involving a real-time embedded system. Topics covered: Introduction to real-time and embedded systems; Time critical I/O handling; Real-time embedded software design; Concurrent programming; Real-time operating systems; Scheduling and time-critical processing; Deadlock management; Process communications; Case studies of real-time embedded systems.", "title": "Real-Time Embedded Systems", "department": "SCALE Dean's Office", "faculty": "Cont and Lifelong Education", "workload": [2, 0.5, 0.5, 3, 3], "prerequisite": "TE2101 and (EE2024E or TEE2028)", "moduleCredit": "4", "moduleCode": "EE4214E", "aliases": ["TEE4214"], "semesterData": [{"semester": 2, "timetable": [{"classNo": "1", "startTime": "2030", "endTime": "2130", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E3-06-14", "day": "Thursday", "lessonType": "Tutorial", "size": 15, "covidZone": "A"}, {"classNo": "1", "startTime": "1800", "endTime": "2030", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E3-06-14", "day": "Thursday", "lessonType": "Lecture", "size": 15, "covidZone": "A"}], "covidZones": ["A"]}], "prereqTree": {"and": ["TE2101", {"or": ["EE2024E", "TEE2028"]}]}}