{"acadYear": "2020/2021", "preclusion": "EE5711R", "description": "This module forms one of the three core modules for the students specializing in Power and Energy area of research. The aim of the module is to introduce the importance of Power Electronics as an enabling technology and their role in efficient electrical energy conversion from one form to another. Power electronics is considered as an integral part of all electronic-equipment starting from\nconsumer electronic products to office automation equipment and leading to large transportation systems, utility applications and distributed renewable energy generation. In this module students will be introduced to the basic principles of operation of switched power converters and the concept of efficient control and regulation of electric energy flow will be addressed. The topics that will be\ncovered are: Power semiconductor switches and their characteristics; AC-to-DC converters and their applications; DC-to-DC converters: analysis and performance; DC-to-AC converters: analysis and performance. Specific power electronic applications to various large scale systems will also be discussed.", "title": "Power Electronic Systems", "department": "Electrical and Computer Engineering", "faculty": "Engineering", "workload": [3, 0, 0, 3, 4], "prerequisite": "[applicable to UG level students only] EE4503; or\n\n[Advisory applicable to GD level students only] Requires undergraduate knowledge in power electronics, example EE3501C, EE4503 or equivalent.", "moduleCredit": "4", "moduleCode": "EE5711", "attributes": {"grsu": true, "mpes2": true}, "semesterData": [{"semester": 2, "timetable": [{"classNo": "01", "startTime": "1800", "endTime": "2100", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "LT2", "day": "Thursday", "lessonType": "Lecture", "size": 50, "covidZone": "A"}], "covidZones": ["A"], "examDate": "2021-04-26T01:00:00.000Z", "examDuration": 120}], "prereqTree": {"or": ["EE4503", "EE3501C"]}, "fulfillRequirements": ["EE6531", "EE5704", "EE6704", "EE6703"]}