{"acadYear": "2020/2021", "preclusion": "EE4214, EE4214E, MCH5205, TD5103, CS5270 Verification of Real Time Systems, CS5250 Advanced Operating Systems", "description": "Introduction to real-time systems, RT and non-RT scheduling algorithms, Analysis and applicability of RT scheduling algorithms, Reliability, fault-tolerance, and availability analysis in RTS, Redundancy in RTS, Process Synchronization, deadlocks, mutual exclusion principles, realization of synchronization algorithms, RTS resource sharing protocols, Modeling and analysis of certain real-time application problems – (i) Client-Server service provisioning system, (ii) Content Distribution Networks – service provisioning system – RTS issues and modelling - Retrieval and multiple request handling.", "title": "Real-Time Systems", "department": "Electrical and Computer Engineering", "faculty": "Engineering", "workload": [3, 0, 0, 3, 4], "prerequisite": "[applicable to UG level students only] EE4218 or CS5272 or CG2271 or CS2106. Advisory: Requires knowledge of algorithms, code reading, basics of single CPU workings and operating systems and must be able to do programming using one of the languages - C/C++/Python/Java in your implementation based 30% CA assignment. In case of hardware project, coding experience with VHDL/Verilog using FPGA is expected. Must be comfortable to read the prescribed research papers independently towards fulfiling your 50% CA requirements. Knowledge from CG2271 Real Time Operating Systems is an added asset. Pre- or co-requisite of relevant modules such as EE4218 Embedded Hardware System Design or CS5272 Embedded Software Design.\n\nOr\n\n[Advisory applicable to GD level students only] Requires knowledge of algorithms, code reading, basics of single CPU workings and operating systems and must be able to do programming using one of the languages - C/C++/Python/Java in your implementation based 30% CA assignment. In case of hardware project, coding experience with VHDL/Verilog using FPGA is expected. Must be comfortable to read the prescribed research papers independently towards fulfiling your 50% CA requirements. Knowledge from CG2271 Real Time Operating Systems is an added asset. Pre- or co-requisite of relevant modules such as EE4218 Embedded Hardware System Design or CS5272 Embedded Software Design.", "moduleCredit": "4", "moduleCode": "EE5903", "attributes": {"grsu": true, "lab": true, "mpes2": true}, "semesterData": [{"semester": 2, "timetable": [{"classNo": "01", "startTime": "1800", "endTime": "2100", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_A", "day": "Wednesday", "lessonType": "Lecture", "size": 79, "covidZone": "Unknown"}], "covidZones": ["Unknown"], "examDate": "2021-05-05T05:00:00.000Z", "examDuration": 120}], "prereqTree": {"or": ["EE4218", "CS5272", "CG2271", "CS2106"]}}