{"acadYear": "2020/2021", "preclusion": "EE5902R, TD5180A, CS5222 Advanced Computer Archtecture; CS5223 Distributed Systems; CS4223 Multi-core Architectures.", "description": "Introduction to multiprocessors systems, architecture issues and different models of computers, program and network properties, memory and processor technologies, RISC,CISC architectures, Intel processors – Case study, superscalar and vector processors, virtual memory technology, bus, cache and shared memory (consistency models), MPI versus SharedMemory Model way of problem solving, queueing models - an introduction, non-linear pipeline design and analysis, pipelining and superscalar techniques, scalable architectures for high performance computers-SIMD computers, introduction to GPU Architecture and programming, FPGA – introduction and basics, basic dataflow architectures, scalability analysis and approaches, analysis using various performance metrics, multiprocessor performance.", "title": "Multiprocessor Systems", "department": "Electrical and Computer Engineering", "faculty": "Engineering", "workload": [3, 0, 0, 3, 4], "prerequisite": "[applicable to UG level students only] EE4204 or EE3207 or EE4218 or CS5272 or CG3207.Advisory: Requires knowledge of single CPU organization (CS2100 Computer Organization) and Architecture (CG3207 Computer Architecture), code reading, basics of single CPU workings and operating systems. For simulation in CA, you must be able to do programming using one of the languages - C/C++/Python/Java. In case of hardware project, coding experience with VHDL/Verilog using FPGA is expected. Must be comfortable to read the prescribed/chosen research papers independently towards fulfiling your 40% CA requirements.\n\nOr\n\n[Advisory applicable to GD level students only] Requires knowledge of single CPU organization (CS2100 Computer Organization) and Architecture (CG3207 Computer Architecture), code reading, basics of single CPU workings and operating systems. For simulation in CA, you must be able to do programming using one of the languages - C/C++/Python/Java. In case of hardware project, coding experience with VHDL/Verilog using FPGA is expected. Must be comfortable to read the prescribed/chosen research papers independently towards fulfiling your 40% CA requirements. Pre-or co-requisite related modules such as EE4218 Embedded Hardware System Design; CS5272 Embedded Software Design or CG3207 Computer Architecture.", "moduleCredit": "4", "moduleCode": "EE5902", "attributes": {"grsu": true, "mpes1": true}, "semesterData": [{"semester": 1, "timetable": [{"classNo": "01", "startTime": "1800", "endTime": "2100", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_A", "day": "Monday", "lessonType": "Lecture", "size": 120, "covidZone": "Unknown"}], "covidZones": ["Unknown"], "examDate": "2020-11-30T05:00:00.000Z", "examDuration": 120}], "prereqTree": {"and": [{"or": ["EE4204", "EE3207", "EE4218", "CS5272", "CG3207", "CS2100"]}, {"or": ["CG3207", "CS2100"]}, {"or": ["CG3207", "EE4218"]}, {"or": ["CS5272", "CG3207"]}]}}