{"acadYear": "2020/2021", "preclusion": "Students who have read a Freshman Seminar before will be precluded from reading a second Freshman Seminar.\n\nStudents staying in Residential Colleges in UTown who will be reading or have read the Junior Seminars will be precluded from reading Freshman Seminar in the Faculty.", "description": "Despite the apparent simplicity of the water molecule, water is probably the most mysterious substance to both science and religions. Almost all religions decree the magic power of pure water. To our experience, where there is water, there is life. Water is widely regarded as the “matrix of life”. Nevertheless, various scientific debates are associated with water. For example, unbelievably, in the 1980s French scientist Benveniste and his collaborators proposed the notion of the “memory of water”.\n\nOn the other hand, proteins are the most important functional players for all forms of life.  An increasing spectrum of human diseases more than neurodegenerative diseases is characterized by aggregation of specific proteins, while aggregation of non-specific proteins are associated with aging even down to Escherichia coli. In 2005, we discovered that these “aggregated/insoluble” proteins could marvellously be solubilized in pure water, which thus offers my group to tackle an emerging but challenging problem in biology: molecular mechanisms for neurodegenerative diseases and aging.\n\nIn this module, we will explore how water shaped the emergence and evolution of life and how proteins get aggregated and subsequently gain toxicity to trigger diseases and aging. Most importantly, the students will have a full freedom to give their own opinions on these topics/debates.", "title": "Mysteries of Water, Protein Aggregation and Diseases", "department": "Biological Sciences", "faculty": "Science", "workload": [0, 3, 0, 3, 4], "moduleCredit": "4", "moduleCode": "FMS1214B", "semesterData": [{"semester": 2, "timetable": [{"classNo": "1", "startTime": "1200", "endTime": "1400", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_B", "day": "Thursday", "lessonType": "Seminar-Style Module Class", "size": 15, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}]}