{"acadYear": "2020/2021", "description": "This module facilitates a theoretical and methodological engagement with 'the cultural' in Geography and related fields of study. Cultural Analysis examines: theoretical developments in geographical studies of culture, particularly interrelations with domains that have conventionally been considered extra-cultural (such as 'the economic' and 'the political'); and methodological techniques and approaches for studying reconceptualised notions of culture (in particular, 'cultural politics' and 'cultural economy'). The module will appeal to advanced students in Geography and related disciplines interested in interrelationships between culture and space.", "title": "Cultural Geographies", "department": "Geography", "faculty": "Arts and Social Science", "workload": [0, 3, 0, 3, 6.5], "prerequisite": "Cohort 2019 and before: Completed 80 MCs, including 28 MCs in GE, or 28 MCs in SN with a minimum CAP of 3.20 or be on the Honours track.\n\n(Global Studies students) Must have read and passed GE1101E and at least one of the following modules: GE2206, GE3206 and GE3237. Completed at least 80MCs, including 28 MCs in GL/GL recognised non-language modules, with a minimum CAP of 3.20 or be on the Honours track.\n\nCohort 2020 onwards: Completed 80 MCs, including 28 MCs in GE, or 28 MCs in SN with a minimum CAP of 3.20 or be on the Honours track.", "moduleCredit": "5", "moduleCode": "GE4213", "attributes": {"mpes1": true}, "semesterData": [{"semester": 1, "timetable": [{"classNo": "1", "startTime": "1500", "endTime": "1800", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_C", "day": "Tuesday", "lessonType": "Seminar-Style Module Class", "size": 40, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}, {"semester": 2, "timetable": [{"classNo": "1", "startTime": "0900", "endTime": "1200", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_C", "day": "Thursday", "lessonType": "Seminar-Style Module Class", "size": 40, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}]}