{"acadYear": "2020/2021", "description": "This course provides an introduction to the application of models (analytical, numerical, physical) through theory and practice in environmental or social sciences. Strengths and weaknesses of individual model types are discussed. Hands-on practical experience in the design and application of computer-based modelling will be a focus of the course. After completion the students should be able to demonstrate an understanding of the concept of modelling, explain why and how modelling is employed in environmental or social sciences and possess skills in developing and critically assessing such models.", "title": "Environmental Modelling", "department": "Geography", "faculty": "Arts and Social Science", "workload": [0, 3, 0, 4, 5.5], "prerequisite": "Cohort 2019 and before: Completed 80 MCs, including 28 MCs in GE with a minimum CAP of 3.20 or be on the Honours track. Must have read and passed GE1101E or at least one of the following modules: GE2219, GE2220, GE2228, GE2229, GE3221 and GE3227.\n\n(BES students from both specialisations)\nMust have read and passed GE1101E or at least one of the following modules: GE2219, GE2220, GE2228, GE2229, GE3221 and GE3227. Completed 80 MCs of NUS modules before they can read any level-4000 GE modules. Do not need to complete 28 MCs of GE modules before they can read any level-4000 GE modules. Do not need a minimum CAP of 3.20 before they can read any level-4000 GE modules.\n\n(Global Studies students)\nMust have read and passed GE1101E and at least one of the following modules: GE2220, GE2228, GE2229, GE3221, GE3223 and GE3227. Completed at least 80MCs, including 28 MCs in GL/GL recognised non-language modules, with a minimum CAP of 3.20 or be on the Honours track\n\nCohort 2020 onwards: Completed 80 MCs, including 28 MCs in GE with a minimum CAP of 3.20 or be on the Honours track. Must have read and passed GE1101E or at least one of the following modules: GE2219, GE2220, GE2228, GE2229, GE3221 and GE3227.\n\n(BES students from both specialisations)\nMust have read and passed GE1101E or at least one of the following modules: GE2219, GE2220, GE2228, GE2229, GE3221 and GE3227. Completed 80 MCs of NUS modules before they can read any level-4000 GE modules. Do not need to complete 28 MCs of GE modules before they can read any level-4000 GE modules. Do not need a minimum CAP of 3.20 before they can read any level-4000 GE modules.", "moduleCredit": "5", "moduleCode": "GE4212", "attributes": {"mpes2": true}, "semesterData": [{"semester": 1, "timetable": [{"classNo": "1", "startTime": "1830", "endTime": "2130", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_C", "day": "Wednesday", "lessonType": "Seminar-Style Module Class", "size": 40, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}]}