{"acadYear": "2020/2021", "description": "This module focuses on the intersection between development and environment in Southeast Asia. Utilising a range of conceptual lenses from sustainable development to political ecology, the module interrogates the varied environmental impacts and ramifications of the development of the region. The module pays particular attention to the ways in which environmental change affects everyday lives. Case studies include issues such as upland living and forest peoples, trans‐boundary environmental issues, and the role and place of Buddhism as an eco‐centric religion. The module encourages a critical view of the trade‐offs between economic growth (development) and environmental protection.", "title": "Development and Environment in Southeast Asia", "department": "Geography", "faculty": "Arts and Social Science", "workload": [0, 3, 0, 3, 6.5], "prerequisite": "Cohort 2012 onwards: Completed 80 MCs, including 28 MCs in GE, or 28 MCs in MS, or 28 MCs in SE with a minimum CAP of 3.20 or be on the Honours track.\n\nCohort 2012 onwards: (BES students from both specialisations). Completed 80 MCs of NUS modules before they can read any level-4000 GE modules. Do not need to complete 28 MCs of GE modules before they can read any level-4000 GE modules. Do not need a minimum CAP of 3.20 before they can read any level-4000 GE modules.", "moduleCredit": "5", "moduleCode": "GE4219", "attributes": {"mpes2": true}, "semesterData": [{"semester": 2, "timetable": [{"classNo": "1", "startTime": "1200", "endTime": "1500", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_C", "day": "Thursday", "lessonType": "Seminar-Style Module Class", "size": 50, "covidZone": "Unknown"}, {"classNo": "2", "startTime": "1200", "endTime": "1500", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_C", "day": "Monday", "lessonType": "Seminar-Style Module Class", "size": 40, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}]}