{"acadYear": "2020/2021", "preclusion": "LL4297V/LL5297V/LL6297V Practice of Corporate Finance and the Law", "description": "Modern corporations draw funding to finance their\nconsumption and investment needs from a variety of\nsources on the basis of extensive cost- benefit\nconsiderations. These include a multitude of factors, such\nas legal considerations, the quantity of funding required\nand cost of capital depending on its source, and impact on\nshareholders and management etc. Corporations may also\nobtain finance by either levering existing assets or\nresorting to unsecured bank lending or bond issues. For\nthe biggest corporations the most important source of\nfinance tends to be the capital markets. These normally\ncomprise the debt and equity markets through which public\ncompanies can offer securities to investors or to transfer\nthe control of the company to new owners in the context of\nan agreed takeover, a hostile take-over bid, or of a private\nequity transaction.\nThis course aims to develop a critical understanding of the\nsubject matter through the combined study of finance\ntheory, corporate law, capital market regulation and the\ncorporate market dynamics, with a special focus on the\ndifferent stakeholders involved in corporate finance. The\nmodule will focus on critical corporate finance issues such\nas: the use of debt and equity; why merge or acquire a\nbusiness; core considerations of the process; purchase\nsale agreements and contractual governance; the role of\nthe board of directors in an acquisition/financing\ntransaction; the permissibility and regulation of takeover\ndefenses in the UK, the US and the EU. It will also discuss\ncross-border IPOS, the problem of market abuse, theory\nand practice of corporate takeovers and their regulation,\nand issues pertinent to private equity transactions, as well\npractical issues relating to structuring corporate acquisition\ndeals and attendant legal documentation. NB: While there\nis inevitably reference to scores of economic concepts and\nsome finance readings the course is specifically addressed\nto law students it is non-mathematical.", "title": "Practice of Corporate Finance and the Law", "department": "FoL Dean's Office", "faculty": "Law", "workload": [0, 3, 0, 0, 7], "prerequisite": "NUS Compulsory Core Law Curriculum or equivalent.", "moduleCredit": "4", "moduleCode": "LL6297", "semesterData": []}