{"acadYear": "2020/2021", "description": "The objective of this introductory course is to provide the basic properties of partial differential equations as well as the techniques to solve some partial differential equations. Partial differential equations are the important tools for understanding the physical world and mathematics itself. This course will cover three types of partial differential equations and will provide a broad perspective on the subject, illustrate the rich variety of phenomena and impart a working knowledge of the most important techniques of analysis of the equations and their solutions.\n\nMajor topics: First-order equations.  Quasi-linear equations.  General first-order equation for a function of two variables.  Cauchy problem.  Wave equation.  Wave equation in two independent variables.  Cauchy problem for hyperbolic equations in two independent variables.  Heat equation.  The weak maximum principle for parabolic equations.  Cauchy problem for heat equation.  Regularity of solutions to heat equation.  Laplace equation.  Green's formulas.  Harmonic functions.  Maximum principle for Laplace equation.  Dirichlet problem.  Green's function and Poisson's formula.", "title": "Partial Differential Equations", "department": "Mathematics", "faculty": "Science", "workload": [3, 1, 0, 0, 6], "prerequisite": "MA3220", "moduleCredit": "4", "moduleCode": "MA4221", "attributes": {"mpes2": true}, "semesterData": [{"semester": 2, "timetable": [{"classNo": "1", "startTime": "1400", "endTime": "1600", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_B", "day": "Tuesday", "lessonType": "Lecture", "size": 95, "covidZone": "Unknown"}, {"classNo": "1", "startTime": "1400", "endTime": "1600", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_B", "day": "Thursday", "lessonType": "Lecture", "size": 95, "covidZone": "Unknown"}, {"classNo": "1", "startTime": "1600", "endTime": "1700", "weeks": [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_B", "day": "Monday", "lessonType": "Tutorial", "size": 95, "covidZone": "Unknown"}], "covidZones": ["Unknown"], "examDate": "2021-05-03T01:00:00.000Z", "examDuration": 150}], "prereqTree": "MA3220", "fulfillRequirements": ["MA5213", "MA5252"]}