{"acadYear": "2020/2021", "preclusion": "NM4101", "description": "This module is to help honours students conduct independent empirical research using the key social science research methods. Students will learn detailed procedures and executable techniques of selected research methods such as survey research, experimental design, in-depth/focus group interviews, and content analysis. The module adopts a Problem Based Learning (PBL) approach, as students will select their own research topics, develop research questions and hypotheses, and design the structure of research activities including measurement, sampling, data collection, and data analysis. Key issues in each step (e.g., instrument development for multi-dimensional constructs) will be discussed through presentations, Q & As, and lectures. The module focuses more on applications and practices than theories, and explains how different types of data and methods can be used to answer research questions relevant to communications and new media.", "title": "Advanced Communications & New Media Research", "department": "Communications and New Media", "faculty": "Arts and Social Science", "workload": [3, 0, 0, 2, 7.5], "prerequisite": "Cohort 2011 and before: \n(1) Completed 80 MCs, including 28 MCs in NM, with a minimum CAP of 3.50 or be on the Honours track. (2) NM2102 or NM2103 or NM2104. \n\nCohort 2012-2019: \n(1) Completed 80MCs, including 28MCs in NM or 28MCs in GL or GL recognised non-language modules, with a minimum CAP of 3.20 or be on the Honours track. (2) NM2101 or NM2103 or NM2104\n\nCohort 2020 onwards: \n(1) Completed 80MCs, including 28MCs in NM, with a minimum CAP of 3.20 or be on the Honours track. (2) NM2101 or NM2103 or NM2104", "moduleCredit": "5", "moduleCode": "NM4102", "attributes": {"mpes1": true, "mpes2": true}, "semesterData": [{"semester": 1, "timetable": [{"classNo": "1", "startTime": "0900", "endTime": "1200", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_C", "day": "Monday", "lessonType": "Seminar-Style Module Class", "size": 45, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}, {"semester": 2, "timetable": [{"classNo": "1", "startTime": "1500", "endTime": "1800", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "LT10", "day": "Monday", "lessonType": "Seminar-Style Module Class", "size": 30, "covidZone": "A"}], "covidZones": ["A"]}]}