{"acadYear": "2020/2021", "preclusion": "NM3206", "description": "This course will help students understand the concept of a digital economy and the ways in which ideas and their various expressions in new media formats are produced, communicated and exchanged in this knowledge-based economy. The module examines the main features of digital economies, presents historical perspectives on their birth and evolution, and reviews some contemporary themes, such as the debates on intellectual property and digital piracy, the appearance of commons-based and open-source models of production, issues of access to and governance of key economic resources, and the challenges posed by electronic distribution and the virtual economies of online games.", "title": "Digital Economies", "department": "Communications and New Media", "faculty": "Arts and Social Science", "workload": [3, 0, 0, 2, 7.5], "prerequisite": "Cohort 2011 and before: (Not applicable to SOC students) Completed 80 MCs, including 28 MCs in NM, with a minimum CAP of 3.50 or be on the Honours track. \n\n(For SOC students) Completed 80 MCs and obtain a minimum CAP of 3.50. \n\nCohort 2012-2019: (Not applicable to SOC students) Completed 80 MCs, including 28 MCs in NM or 28 MCs in GL/GL recognised non‐language modules, with a minimum CAP of 3.20 or be on the Honours track. \n\n(For SOC students) Completed 80 MCs and obtain a minimum CAP of 3.20.\n\nCohort 2020 onwards: (Not applicable to SOC students) Completed 80 MCs, including 28 MCs in NM, with a minimum CAP of 3.20 or be on the Honours t7rack. \n\n(For SOC students) Completed 80 MCs and obtain a minimum CAP of 3.20.", "moduleCredit": "5", "moduleCode": "NM4213", "attributes": {"mpes1": true}, "semesterData": [{"semester": 1, "timetable": [{"classNo": "1", "startTime": "1500", "endTime": "1800", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "E-Learn_C", "day": "Tuesday", "lessonType": "Seminar-Style Module Class", "size": 50, "covidZone": "Unknown"}], "covidZones": ["Unknown"]}]}