{"acadYear": "2020/2021", "preclusion": "UTS2112 or GEM29% or UTC21%", "description": "With a focus on Asia, this course draws on a diverse range of literatures to provide a broad context for understanding the dynamics between humans and animals. Southeast Asia is one of last regions in the world with extensive rain forest habitat for wild animals, but these creatures are threatened by burgeoning urbanization and agriculture. The module will go beyond a focus on wildlife, however, to consider our relationship with ‘urban animals’ of many types. Through seminar-style classes and fieldtrips conducted around Singapore, the module will test new perspectives from international and regional studies of human-animal interaction.", "title": "Animals and the City", "department": "Tembusu College", "faculty": "Residential College", "workload": [3, 0, 0, 0, 7], "prerequisite": "This four-week intensive module is intended only to be offered in the summer term.\n\nEnrolment will be offered to a select group of students, half of them from our IARU and Tembusu College partner residential colleges/university, and the others from NUS. NUS students may take this module as an unrestricted elective. Tembusu College students may take this module to count towards the University Town College Programme (as a Senior Seminar).\n\nNUS undergraduates, including Tembusu students, should have a minimum CAP of 3.0 on a 5-point scale. Non-NUS students will be assessed based on recruitment criteria and procedures administered by each participating residential college/university in consultation with NUS Tembusu College. Non-NUS students will have to apply to their home institutions for credit.\n\nIdeally, students in this class will be in their second or third year of a four-year undergraduate program, but in general we will accept undergraduates at any level.\n\nFor Tembusu students - GEM1902% or GEM1912% or UTC11%", "moduleCredit": "4", "moduleCode": "UTC2112", "attributes": {"su": true}, "semesterData": [], "prereqTree": {"or": ["GEM1902", "GEM1912"]}}