{"acadYear": "2020/2021", "preclusion": "GEM3901", "description": "A UROP involves the student working with a supervisor, and sometimes in a team, on an existing research project. A Tembusu UROP may focus on\nresearch related to a particular aspect of life, education or organization at Tembusu College. Alternatively, students may participate in research led\nby a College Fellow or other academic, as long as the project gives the student exposure to forms of expertise and/or interests that go beyond any\nparticular discipline. The aim of the UROP is to help support a student’s academic and professional development through a meaningful research\napprenticeship. The UROP is a graded module.", "title": "Tembusu Undergraduate Research Opportunity (UROP)", "department": "Tembusu College", "faculty": "Residential College", "workload": [1, 0, 0, 7, 2], "prerequisite": "Ideally, a student should have completed the University Town Residential Programme of five modules before embarking on this UROP. \n\nHowever, due to the diverse student population at Tembusu, this is not always possible, and some exceptional students may want the chance to embark on a Tembusu UROP already in their second year. The prerequisite is that students should have completed at least one Junior or Senior Seminar at the College, as well as at least one Ideas and Exposition module or a faculty-based writing course.\n\nFor student-candidates who meet the prerequisite but who have not finished the five-module UTCP, the prospective supervisor/research leader is required to make a case to the UROP coordinator and/or the Director of Studies. The case should be based on (1) an evaluation of the student’s demonstrated aptitude and motivation for independent research and inquiry, and (2) the student’s demonstrated potential for producing high-quality academic writing.", "moduleCredit": "4", "moduleCode": "UTC3102", "attributes": {"urop": true}, "semesterData": [{"semester": 2, "timetable": [{"classNo": "1", "startTime": "0600", "endTime": "0900", "weeks": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "venue": "TC-SR3", "day": "Monday", "lessonType": "Seminar-Style Module Class", "size": 2, "covidZone": "A"}], "covidZones": ["A"]}]}