{"acadYear": "2020/2021", "preclusion": "GEM3900", "description": "The Independent Study Module provides an opportunity for students who are staying at Tembusu College for a third year to do some independent \ncritical reading or research work. Unlike a UROP, where the student contributes to an existing research project, an ISM is an individual study\nprogramme conceptualized by the student. ISMs undertaken at Tembusu College must be interdisciplinary, multi‐disciplinary, or trans‐disciplinary in\ntopic and/or approach. Student and supervisor need to submit for approval an ISM contract that gives a clear account of the topic, programme of study,\nevaluation, and other pertinent details. The ISM is a graded module.", "title": "Independent Study", "department": "Tembusu College", "faculty": "Residential College", "workload": [0, 0, 0, 0, 10], "prerequisite": "Ideally, a student should have completed the University Town\nCollege Programme of five modules before pursuing Independent Study.\nHowever, due to the diverse student population at Tembusu, the\nprerequisite is that students should have completed at least one Senior\nSeminar. This ensures that a student has gained some familiarity\nwith the exploration of topics in an inter‐disciplinary, multi‐disciplinary\nor trans‐disciplinary fashion. The student should approach a College\nFellow to work out an agreed topic, readings, and assignments for the\nmodule. Part of this conversation should be to specify in what sense\nthe topic and/or approach are interdisciplinary, multi‐disciplinary\nor trans‐disciplinary in character. A formal ISM contract is to be\nsubmitted to the Director of Studies for approval. Evaluation is based on\n100% Continuous Assessment and must be worked out between the\nstudent and the supervisor prior to seeking the College’s approval. In\nthe course of the semester, between 4 and 6 meetings between student\nand supervisor are expected. The student is expected to play an active\nrole in setting the agenda and preparing for these meetings.", "moduleCredit": "4", "moduleCode": "UTC3101", "semesterData": []}